Revit 2027 API
CurveLoop Constructor
 Constructs a new empty curve loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveLoop()
Public Sub New
public:
CurveLoop()
new : unit -> CurveLoop
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace